---
title : "비지도 학습은?"
mathjax: true
layout: post
---

## 지도학습은 무슨 뜻?
구글 검색하면 정의정도는 알 수 있으니 직관적인 느낌을 얻어보려한다.

통계학을 배우는 입장에선 우리가 학부 때 범주형자료분석을 배웠을 것이다. 
그 과목에서 처음으로 배우는 게 독립변수와 종속변수 또는 설명변수와 반응변수 이런 것을 배웠을 것이다.
이 처럼 X,Y를 각각 설명변수와 반응변수로 두고 두 변수간의 관계를 파악하는 데 집중하는 것이면서
확실한 표현은 아니지만 어떠한 확률모형을 두고 가정한 상태에서 데이터를 그 모형에 넣어서 변수간 관계를 파악하는 게 지도학습이다.

간단한 예시를 생각해 보면, 내가 갖고 있는 데이터로 회귀모형을 가질 수 있다 가정하고 그 모형에 적용시켜 학습하는 게 지도학습이라 생각한다.
정확한 것은 아니니 본인만의 직관적인 느낌을 갖기 바란다.

## 비지도를 해야 하는 이유는?
문득 '비지도학습을 하지 않고 지도학습을 하면 안되나' 라고 생각이 들 수 있다.
하지만 살다보면 예외가 있고 새로운 것을 공부해야 하는 건 당연하다. 
보통 내가 생각하는 통계학자는 데이터가 어떠한 모형(분포)을 가질 것이라는 가정을 갖고 데이터를 다룬다.
근데, 
- 어떠한 가정을 갖기가 어렵다면?
- 데이터를 보고 모형을 생각해 내기 어렵다면
- 데이터의 정보가 너무 부족하다면
등등 

통계학 개론에 예시로 나오는 가정들을 할 수 없을 정도로 정보가 없다면 우린 막막할 것이다.
이러한 경우가 어떤거냐면 마트에서 고객마다 어떠한 상품을 장바구니에 넣고 계산을 하는 지 모델링을 하기가 너무 어렵다.
상품종류부터 너무많고 경우의 수가 기하급수적으로 많으며 각 경우의 확률을 정하는 것까지 한숨나오는 일이다.

데이터를 통해 분포를 만들어 대략 어떠한 분포인지 파악할 수 있다면 좋겠지만 변수의 차원이 높기 때문에 정규분포를 제외한 다변량분포는 미지의 영역이다.
하지만 우리가 알고 싶은 건 데이터의 전체 즉, 분포 전체를 알아야 할 필요는 없다.
필요한 부분만 얻으면 될 일이다.

그래서 그것을 알아보고자 비지도학습이 필요하다.

끝내기 전에, 용어들이 생소하거나 친숙하지 않은 것들이 많아서 이해하는 데 시간이 많이 걸리므로 유의하자.
